     D WriteJsonError  PR
     D  JsonMarker                 4096    value varying
     D EndJsonError    PR
     D MonitorSQL      PR

     D JsonError       S               N   inz(*OFF)                            // First Json Error
     D  JsonFile       S           4096
